# 'brew tap'
tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/ei9h7/homebrew-cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions", "https://github.com/ei9h7/homebrew-cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/command-not-found"
tap "mas-cli/tap"
tap "nrlquaker/createzap"

# 'brew install --cask'
# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true
cask "1clipboard"
cask "amazon-music"
cask "angry-ip-scanner"
cask "appcleaner"
cask "atom"
cask "balenaetcher"
cask "backuploupe"
cask "battle-net"
cask "boxcryptor"
cask "carbon-copy-cloner5"
cask "command-pad"
cask "docker"
cask "duplicati"
cask "eloston-chromium"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-victor-mono-nerd-font"
cask "gitkraken"
cask "google-chrome"
cask "google-drive-file-stream"
cask "gpg-suite-no-mail"
cask "icanhazshortcut"
cask "jetbrains-toolbox"
cask "keka"
cask "kekaexternalhelper"
cask "keybase"
cask "lens"
cask "macfuse"
cask "macs-fan-control"
cask "macvim"
cask "mdrp"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "multipass"
cask "musicbrainz-picard"
cask "nordlocker"
cask "nordpass"
cask "nordvpn"
cask "nvidia-geforce-now"
cask "obs"
cask "obs-ndi"
cask "obs-virtualcam"
cask "obs-websocket"
cask "parallels12"
cask "phpstorm"
cask "plex"
cask "plexamp"
cask "pycharm-edu"
cask "raspberry-pi-imager"
cask "spotify"
cask "spotify-now-playing"
cask "steam"
cask "the-unarchiver"
cask "tunnelblick"
cask "unetbootin"
cask "unity"
cask "unity-hub"
cask "vagrant"
cask "virtualbox"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "wireshark"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "yubico-yubikey-personalization-gui"
cask "yubico-yubikey-piv-manager"

# 'brew install'
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bash-snippets"
brew "ca-certificates"
brew "ccat"
# brew "docker", link: false
# brew "docker-compose", link: false
# brew "docker-compose-completion"
# brew "docker-machine-completion"
brew "e2fsprogs"
brew "ethereum"
brew "fortune"
brew "gh"
brew "git"
brew "go"
brew "lazydocker"
brew "libtool"
brew "python@3.9"
brew "imagemagick"
brew "libmusicbrainz"
brew "libyubikey"
brew "luarocks"
brew "m4"
brew "micro"
brew "node"
brew "nyancat"
brew "openjdk"
brew "p7zip"
brew "pam_yubico"
brew "perl@5.18"
brew "rclone"
brew "rsync"
brew "rsync-time-backup"
brew "screen"
brew "shpotify"
brew "storj-uplink"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tmux-xpanes"
brew "wimlib"
brew "x11vnc"
brew "ykpers"
brew "yubico-piv-tool"
brew "yubikey-agent", restart_service: true
brew "zsh"
brew "zsh-git-prompt"
brew "zsh-lovers"

# 'mas install'
brew "mas-cli/tap/mas"
mas "Amphetamine", id: 937984704
mas "Canary Mail", id: 1236045954
# mas "Capo", id: 696977615
mas "Cryptext", id: 484889220
mas "Crypto-Maker", id: 1012138285
mas "Disk Speed Test", id: 425264550
mas "Emporter", id: 1406832001
mas "Encrypto", id: 935235287
mas "Filezilla", id: 1298486723
mas "Fhotoroom X", id: 909212772
mas "Folder Tidy", id: 486626129
mas "Friendly Streaming", id: 553245401
mas "Gemini 2", id: 1090488118
mas "iBooks Author", id: 490152466
mas "Marko", id: 607997198
mas "Mint QuickView", id: 533491939
mas "Numbers", id: 409203825
mas "Ownr Crypto Wallet", id: 1520395378
mas "Pages", id: 409201541
mas "Password Factory", id: 888806818
mas "Silicio", id: 933627574
mas "SnailGit Lite", id: 1099475282
mas "Spike Email", id: 707452888
mas "StartUp", id: 1452212620
mas "Swift Playgrounds", id: 1496833156
mas "System Designer", id: 1102494854
mas "Toolbox for Pages", id: 571654652
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
mas "XCRegex", id: 1237435595
mas "ZipMounter Lite", id: 1438287690

# 'whalebrew install'
brew "whalebrew"
# whalebrew "3i9h7/docker-pyrit"
# whalebrew "whalebrew/wget"
